var manningtabledata = [
    {
        "id": "ПАО Русполимет",
        "post":"Генеральный директор",
        "surname":"Клочай Максим Викторович",
        "phone":"5-XX-XX"
        //"parent": "#"


    },
   /*
    {
        "id": "ООО Старт",
        "parent": "#"

    },
 */
    {
        "id": "Дирекция по оперативной работе",
        "parent": "ПАО Русполимет",
        "post":"Директор по оперативной работе",
        "surname":"Сенин Александр Сергеевич",
        "phone":"5-XX-XX"



    },

    {
        "id": "Дирекция по производству",
        "parent": "Дирекция по оперативной работе",
        "post":"Директор по производству",
        "surname":"Игошин Павел генадьевич",
        "phone":"5-XX-XX"
    },
    {
        "id": "Управление производственного планирования и сопровождения производства",
        "parent": "Дирекция по производству",
        "post":"wwwwwwwwwwwwwww",
        "surname":"iiiiiiii ffff oooooooo",
        "phone":"5-XX-XX"
    },
    {
        "id": "Кольцепрокатное производство",
        "parent": "Дирекция по производству",
        "post":"wwwwwwwwwwwwwww",
        "surname":"iiiiiiii ffff oooooooo",
        "phone":"5-XX-XX"
    },
    {
        "id": "Металлургичекое производство",
        "parent": "Дирекция по производству",
        "post":"wwwwwwwwwwwwwww",
        "surname":"iiiiiiii ffff oooooooo",
        "phone":"5-XX-XX"
    },
    {
        "id": "Обособленное подразделение Цех энергетичекого машиностроения",
        "parent": "Дирекция по производству",
        "post":"wwwwwwwwwwwwwww",
        "surname":"iiiiiiii ffff oooooooo",
        "phone":"5-XX-XX"
    },
    {
        "id": "Управление метериально-техничекого снабжения",
        "parent": "Дирекция по оперативной работе",
        "post":"wwwwwwwwwwwwwww",
        "surname":"iiiiiiii ffff oooooooo",
        "phone":"5-XX-XX"
    },
    {
        "id": "Управление технического обеспечения и ремонтов",
        "parent": "Дирекция по оперативной работе",
        "post":"wwwwwwwwwwwwwww",
        "surname":"iiiiiiii ffff oooooooo",
        "phone":"5-XX-XX"


    },
    {
        "id": "Группа внедрения эффективной производственной ситемы",
        "parent": "Дирекция по оперативной работе","post":"wwwwwwwwwwwwwww",
        "surname":"iiiiiiii ffff oooooooo",
        "phone":"5-XX-XX"


    },
    //Техническая дирекция
    {
        "id": "Техническая дирекция",
        "parent": "ПАО Русполимет",
    },
    {
        "id": "Центр научно-технического и инновационного развития",
        "parent": "Техническая дирекция",
    },
    {
        "id": "Центр контроля и менеджмента качества",
        "parent": "Техническая дирекция",
    },
    {
        "id": "Отдел главного технолога",
        "parent": "Техническая дирекция",
    },
    {
        "id": "Отдел главного металлурга",
        "parent": "Техническая дирекция",
    },
    {
        "id": "Отдел главного термиста",
        "parent": "Техническая дирекция",
    },
    {
        "id": "Отдел технологической оснастки",
        "parent": "Техническая дирекция",
    },
    //Дирекция по маркетингу и продажам
    {
        "id": "Дирекция по маркетингу и продажам",
        "parent": "ПАО Русполимет",
    },
    {
        "id": "Управление авиационных продаж",
        "parent": "Дирекция по маркетингу и продажам",
    },
    {
        "id": "Управление продаж общемашиностроительного назначения",
        "parent": "Дирекция по маркетингу и продажам",
    },
    {
        "id": "Отдел продаж атомного и эренго.машиностроения",
        "parent": "Управление продаж общемашиностроительного назначения",
    },
    {
        "id": "Отдел общемашиностроительных продаж",
        "parent": "Управление продаж общемашиностроительного назначения",
    },
    {
        "id": "Управление экспортных продаж",
        "parent": "Дирекция по маркетингу и продажам",

    },
    {
        "id": "Управление металлургических продаж",
        "parent": "Дирекция по маркетингу и продажам",

    },
    {
        "id": "Отдел маркетинга и сорпавождения продаж",
        "parent": "Дирекция по маркетингу и продажам",

    },
    {
        "id": "Управление отгрузок и логистики",
        "parent": "Дирекция по маркетингу и продажам",

    },{
        "id": "Группа отгрузки готовой продукции",
        "parent": "Управление отгрузок и логистики",

    },

//Дирекция по персоналу
    {
        "id": "Дирекция по персоналу",
        "parent": "ПАО Русполимет",
    },
    {
        "id": "Отдел подбора, учета и развития персонала",
        "parent": "Дирекция по персоналу",
    },
    {
        "id": "Отдел организации труда и зарабной платы",
        "parent": "Дирекция по персоналу",
    },
    {
        "id": "Отдел социальных объектов льгот и гарантий",
        "parent": "Дирекция по персоналу",
    },
    {
        "id": "Отдел корпоративных коммуникаций",
        "parent": "Дирекция по персоналу",
    },
    //Дирекция по экономике и финансам
    {
        "id": "Дирекция по экономике и финансам",
        "parent": "ПАО Русполимет",

    },
    {
        "id": "Бухгалтерия",
        "parent": "Дирекция по экономике и финансам",

    },
    {
        "id": "Планово-экономический отдел",
        "parent": "Дирекция по экономике и финансам",

    },
    {
        "id": "Финансовый отдел",
        "parent": "Дирекция по экономике и финансам",

    },
    {
        "id": "Отдел информационных технологий",
        "parent": "Дирекция по экономике и финансам",

    },
    //Правовое управление

    {
        "id": "Правовое управление",
        "parent": "ПАО Русполимет",

    },
    {
        "id": "Отдел акционерной собственности",
        "parent": "Правовое управление",

    },
    //Дирекция по безопасности
    {
        "id": "Дирекция по безопасности",
        "parent": "ПАО Русполимет",

    },
    {
        "id": "Упарвление корпоративной защиты",
        "parent": "Дирекция по безопасности",

    },
    {
        "id": "Отдел экономической защиты",
        "parent": "Дирекция по безопасности",

    },
    {
        "id": "Отдел технических средств охраны и связи",
        "parent": "Дирекция по безопасности",

    },
    {
        "id": "Отдел контроля режима",
        "parent": "Дирекция по безопасности",

    },
    {
        "id": "Добровольная пожарная команда",
        "parent": "Дирекция по безопасности",

    },
    //Отдел управления делами
    {
        "id": "Отдел управления делами",
        "parent": "ПАО Русполимет",

    },

    {
        "id": "Гостиница",
        "parent": "Отдел управления делами",

    },
    {
        "id": "Нижегородское представительство",
        "parent": "Отдел управления делами",

    },
    {
        "id": "Московский филиал",
        "parent": "Отдел управления делами",

    },
    //Отдел промышленной безопасности
    {
        "id": "Отдел промышленной безопасности",
        "parent": "ПАО Русполимет",

    },
    {
        "id": "Группа промышленной безопасности",
        "parent": "Отдел промышленной безопасности",

    },
    {
        "id": "Лаборатория промышленной санитории и экологии",
        "parent": "Отдел промышленной безопасности",

    },
    {
        "id": "Отдел по внедрению производственной системы",
        "parent": "ПАО Русполимет",

    },
    {
        "id": "Общий отдел",
        "parent": "ПАО Русполимет",

    },
    {
        "id": "Спецотдел",
        "parent": "ПАО Русполимет",

    },
    {
        "id": "Отдел по связям с общественностью",
        "parent": "ПАО Русполимет",

    },

//Дирекция по контроллингу
    {
        "id": "Дирекция по контроллингу",
        "parent": "ПАО Русполимет",

    },
    /*
    {
        "id": "",
        "parent": "",

    },

    {
        "id": "Подразделение 02",
        "parent": "ООО Старт",
        "text": "Подразделение 02"
    },
    {
        "id": "Подразделение 03",
        "parent": "ООО Старт",
        "text": "Подразделение 03"
    }
    */

];


function getManningtableData() {
    ManningtableData = [];
    manningtabledata.forEach(function (item, i, arr) {
        item.text = item.id;
        if (item.parent !== "#") {
            //item.icon = "jstree-file";
        }
        ManningtableData.push(item);
        //console.log(ManningtableData)
    });
    return ManningtableData;

}
function getManningtableDataNode() {
    ManningtableDataNode = [];
    var n=0;
    manningtabledata.forEach(function (item, i, arr) {
        item.name = item.id;
        //item.key = item.name;
        n++;
        if (item.parent !== "#") {
            //item.icon = "jstree-file";
        }
        ManningtableDataNode.push(item);
        //console.log(ManningtableData)
    });
    return ManningtableDataNode;

}

