var st_RPM_data = [
    {
        "id": "Электро- сталеплавильный комплекс \"DANIELI\"",
        //"post":"Генеральный директор",
        //"surname":"Клочай Максим Викторович",
        //"phone":"5-XX-XX"
        //"parent": "#"


    },

    {
        "id": "ДСП-6",
        "parent": "Электро- сталеплавильный комплекс \"DANIELI\"",
    },
    {
        "id": "Печь-ковш",
        "parent": "Электро- сталеплавильный комплекс \"DANIELI\"",
    },
    {
        "id": "Вакууматор",
        "parent": "Электро- сталеплавильный комплекс \"DANIELI\"",
    },
    {
        "id": "Слеразливочная тележка",
        "parent": "Электро- сталеплавильный комплекс \"DANIELI\"",
    },
    {
        "id": "Газоочистка",
        "parent": "Электро- сталеплавильный комплекс \"DANIELI\"",
    },
    {
        "id": "Крановое хозяйство",
        "parent": "Электро- сталеплавильный комплекс \"DANIELI\"",
    },
    //ДСП-6
    {
        "id": "Гидростанция комплекса",
        "parent": "ДСП-6",
    },
    {
        "id": "Система охлаждения",
        "parent": "ДСП-6",
    },
    {
        "id": "Система высокого нарряжения",
        "parent": "ДСП-6",
    },
    {
        "id": "Трансформатор",
        "parent": "ДСП-6",
    },
    {
        "id": "Система управления электродами",
        "parent": "ДСП-6",
    },
    {
        "id": "Сталевоз ДСП-6",
        "parent": "ДСП-6",
    },

//..Печь-ковш
    {
        "id": "Система высокого нарряжения",
        "parent": "Печь-ковш",
    },
    {
        "id": "Трансформатор",
        "parent": "Печь-ковш",
    },
    {
        "id": "Система управления электродами",
        "parent": "Печь-ковш",
    },
    {
        "id": "Система охлаждения",
        "parent": "Печь-ковш",
    },
    {
        "id": "Слевоз Печи-ковша",
        "parent": "Печь-ковш",
    },
//Вакууматор
    {
        "id": "Система управления вакуумными насосами",
        "parent": "Вакууматор",
    },
    {
        "id": "Система трейб аппаратов",
        "parent": "Вакууматор",
    },
//..Газоочистка
    {
        "id": "Нагнетатели",
        "parent": "Газоочистка",
    },
    {
        "id": "Бустерные насосы",
        "parent": "Газоочистка",
    },
    {
        "id": "Система фильтров",
        "parent": "Газоочистка",
    },
//..Крановое хозяйство
    {
        "id": "Кран №5",
        "parent": "Крановое хозяйство",
    },
    {
        "id": "Кран №3",
        "parent": "Крановое хозяйство",
    },
    {
        "id": "Кран №",
        "parent": "Крановое хозяйство",
    },
//Слеразливочная тележка
    {
        "id": "Гидростанция",
        "parent": "Слеразливочная тележка",
    },
    {
        "id": "Система управления",
        "parent": "Слеразливочная тележка",
    },
    {
        "id": "Весовая система",
        "parent": "Слеразливочная тележка",
    },

];
